In [1]:
import pandas as pd
#read dataset
df = pd.read_csv("sample_data.csv")
print(df.head())

      Name   Age  Gender         City   Salary
0    Alice  25.0  Female     New York  50000.0
1      Bob  30.0    Male  Los Angeles  60000.0
2  Charlie  35.0    Male      Chicago  70000.0
3      Bob  30.0    Male  Los Angeles  60000.0
4    David   NaN    Male      Houston  80000.0

In [2]:
#check the structure
df.shape                 #number of rows and columns
df.info()                #datatypes and missing values
df.describe()            #

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    9 non-null      object
 1   Age     9 non-null      float64
 2   Gender  10 non-null     object
 3   City    10 non-null     object
 4   Salary  9 non-null      float64
dtypes: float64(2), object(3)
memory usage: 532.0+ bytes

               Age        Salary
count     9.000000  9.000000e+00
mean    137.777778  1.057667e+06
std     323.375083  2.978390e+06
min      22.000000  5.000000e+04
25%      29.000000  6.000000e+04
50%      30.000000  7.000000e+04
75%      35.000000  7.200000e+04
max    1000.000000  9.000000e+06

In [3]:
#check and FIX missing values
df.isnull().sum()

Name      1
Age       1
Gender    0
City      0
Salary    1
dtype: int64

In [7]:
df['Name'] = df['Name'].fillna("Unknown")
df['Age'] = df['Age'].fillna(df['Age'].mean())              #fill with avarage age
df['Salary'] = df['Salary'].fillna(df['Salary'].median()) 
#fill with median salary
df.head()

      Name         Age  Gender         City   Salary
0    Alice   25.000000  Female     New York  50000.0
1      Bob   30.000000    Male  Los Angeles  60000.0
2  Charlie   35.000000    Male      Chicago  70000.0
3      Bob   30.000000    Male  Los Angeles  60000.0
4    David  137.777778    Male      Houston  80000.0

In [8]:
#Remove dupilicates
duplicate_count = df.duplicated().sum()
print("Number of duplicate rows before removing:",duplicate_count)

Number of duplicate rows before removing: 1

In [10]:
duplicate_count_after = df.duplicated().sum()
print("Number of duplicte rows after removing:",duplicate_count_after)

Number of duplicte rows after removing: 1